Revit 2026 API

# ElementBinding Class

---

A base class for all types of binding that attach to an element.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBBinding Autodesk.Revit.DBElementBinding Autodesk.Revit.DBInstanceBinding Autodesk.Revit.DBTypeBinding

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ElementBinding : Binding
```
```vb
Public MustInherit Class ElementBinding
	Inherits Binding
```
```cpp
public ref class ElementBinding abstract : public Binding
```
```fsharp
[<AbstractClassAttribute>]
type ElementBinding =
    class
        inherit Binding
    end
```

The ElementBinding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Categories | Retrieve or set the categories to which a parameter definition will be bound. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This base class provides methods that are common to all types of binding that work with elements.

#### Reference

Autodesk.Revit.DB Namespace